jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
        // Verify if the advertised appearance matches the provided appearance.
        for (index = 0; index < counter; index++)
        {
                if (ble_advdata_appearance_find(p_adv_report->data.p_data,
                                                data_len,
                                                &p_appearance_filter->appearance[index]))
                {
                        return true;
                }
        }
        return false;
}


/**@brief Function for adding appearance to the scanning filter.
 *
 * @param[in]     appearance       Appearance to be added.
 * @param[in,out] p_scan_ctx       Pointer to the Scanning Module instance.
 *
 * @retval NRF_SUCCESS             If the filter is added successfully or if you try to add a filter that was already added before.
 * @retval NRF_ERROR_NULL          If a NULL pointer is passed as input.
 * @retval NRF_ERROR_NO_MEMORY     If the number of available filters is exceeded.
 */
static ret_code_t nrf_ble_scan_appearance_filter_add(nrf_ble_scan_t * const p_scan_ctx,
                                                     uint16_t appearance)
{
        uint16_t * p_appearance_filter = p_scan_ctx->scan_filters.appearance_filter.appearance;
        uint8_t  * p_counter           = &p_scan_ctx->scan_filters.appearance_filter.appearance_cnt;
        uint8_t index;

        // If no memory.
        if (*p_counter >= NRF_BLE_SCAN_APPEARANCE_CNT)
        {
                return NRF_ERROR_NO_MEM;
        }

        // Check for duplicated filter.
        for ( index = 0; index < NRF_BLE_SCAN_APPEARANCE_CNT; index++)
        {
                if (p_appearance_filter[index] == appearance)
                {
                        return NRF_SUCCESS;
                }
        }

        // Add appearance to the filter.
        p_appearance_filter[(*p_counter)++] = appearance;
        NRF_LOG_DEBUG("Added filter on appearance %x", appearance);
        return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_APPEARANCE_CNT



#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
/** @brief Function for comparing the provided short name with the advertised short name.
 *
 * @param[in] p_adv_report    Advertising data to parse.
 * @param[in] p_scan_ctx      Pointer to the Scanning Module instance.
 *
 * @retval True when the names match. False otherwise.
 */
static bool adv_manufacturer_specific_compare(ble_gap_evt_adv_report_t const * const p_adv_report,
                                              nrf_ble_scan_t const * const p_scan_ctx)
{
        nrf_ble_scan_manufacturer_filter_t const * p_manufacturer_filter =  &p_scan_ctx->scan_filters.manufacturer_filter;
        uint8_t counter = p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_cnt;
        uint8_t index;
        uint16_t data_len;

        data_len = p_adv_report->data.len;

        // Compare the name found with the name filters.
        for (index = 0; index < counter; index++)
        {
                NRF_LOG_HEXDUMP_INFO(p_adv_report->data.p_data, data_len);
                if (ble_advadata_manufacturer_find(p_adv_report->data.p_data,
                                                   data_len,
                                                   &p_manufacturer_filter->manufacturer_specific[index],
                                                   NRF_BLE_ADV_MANUFACTURER_SPECIFIC_DEVICE_NAME_START_OFFSET, NRF_BLE_ADV_MANUFACTURER_SPECIFIC_DEVICE_NAME_LENGTH))
                {
                        return true;
                }
        }

        return false;
}


/**@brief Function for adding the manufacturer specific of the peripheral to the scanning filter.
 *
 * @param[in]     p_manufacturer_specific      manufacturer specific of the peripheral.
 * @param[in,out] p_scan_ctx        Pointer to the Scanning Module instance.
 *
 * @retval NRF_SUCCESS              If the filter is added successfully or if you try to add a filter that was already added before.
 * @retval NRF_ERROR_NULL           If a NULL pointer is passed as input.
 * @retval NRF_ERROR_DATA_SIZE      If the name filter length is too long. The maximum filter name length corresponds to @ref NRF_BLE_SCAN_SHORT_NAME_MAX_LEN.
 * @retval NRF_ERROR_NO_MEMORY      If the number of available filters is exceeded.
 */
// static ret_code_t nrf_ble_scan_manufacturer_specific_filter_add(nrf_ble_scan_t            * const p_scan_ctx,
//                                                                 uint8_t const * p_manufacturer_specific, uint8_t payload_offset, uint8_t payload_len)
static ret_code_t nrf_ble_scan_manufacturer_specific_filter_add(nrf_ble_scan_t            * const p_scan_ctx,
                                                                uint8_t const * p_manufacturer_specific, uint8_t len)
{
        uint8_t index;
        uint8_t * p_counter =  &p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_cnt;
        uint8_t manufacturer_specific_payload_len = len;//strlen(p_manufacturer_specific);

        if (( manufacturer_specific_payload_len == 0) || manufacturer_specific_payload_len > NRF_BLE_ADV_MANUFACTURER_SPECIFIC_LEN)
        {
                return NRF_ERROR_DATA_SIZE;
        }

        if (*p_counter >= NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT)
        {
                return NRF_ERROR_NO_MEM;
        }

        // Check for duplicated filter.
        for (index = 0; index < NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT; index++)
        {
                if (!strcmp(p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_specific[index], p_manufacturer_specific))
                {
                        return NRF_SUCCESS;
                }
        }

        // Add name to filter.
        memcpy(p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_specific[(*p_counter)++],
               p_manufacturer_specific,
               strlen(p_manufacturer_specific));

        NRF_LOG_INFO("Adding filter on manufacturer data");

        NRF_LOG_HEXDUMP_INFO(p_manufacturer_specific, strlen(p_manufacturer_specific));

        return NRF_SUCCESS;
}
#endif

