jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
ret_code_t nrf_ble_scan_filter_set(nrf_ble_scan_t     * const p_scan_ctx,
                                   nrf_ble_scan_filter_type_t type,
                                   void const               * p_data)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);
        VERIFY_PARAM_NOT_NULL(p_data);

        switch (type)
        {
#if (NRF_BLE_SCAN_NAME_CNT > 0)
        case SCAN_NAME_FILTER:
        {
                char * p_name = (char *)p_data;
                return nrf_ble_scan_name_filter_add(p_scan_ctx, p_name);
        }
#endif

#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        case SCAN_SHORT_NAME_FILTER:
        {
                nrf_ble_scan_short_name_t * p_short_name = (nrf_ble_scan_short_name_t *)p_data;
                return nrf_ble_scan_short_name_filter_add(p_scan_ctx, p_short_name);
        }
#endif

#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        case SCAN_ADDR_FILTER:
        {
                uint8_t * p_addr = (uint8_t *)p_data;
                return nrf_ble_scan_addr_filter_add(p_scan_ctx, p_addr);
        }
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        case SCAN_UUID_FILTER:
        {
                ble_uuid_t * p_uuid = (ble_uuid_t *)p_data;
                return nrf_ble_scan_uuid_filter_add(p_scan_ctx, p_uuid);
        }
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        case SCAN_APPEARANCE_FILTER:
        {
                uint16_t appearance = *((uint16_t *)p_data);
                return nrf_ble_scan_appearance_filter_add(p_scan_ctx, appearance);
        }
#endif

#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        case SCAN_MANUFACTURER_FILTER:
        {
                uint8_t * p_manufacturer = (uint8_t *)p_data;
                uint8_t len  = strlen(p_data);
                return nrf_ble_scan_manufacturer_specific_filter_add(p_scan_ctx, p_manufacturer, NRF_BLE_ADV_MANUFACTURER_SPECIFIC_DEVICE_NAME_LENGTH);
        }
#endif

        default:
                return NRF_ERROR_INVALID_PARAM;
        }
}


ret_code_t nrf_ble_scan_all_filter_remove(nrf_ble_scan_t * const p_scan_ctx)
{
#if (NRF_BLE_SCAN_NAME_CNT > 0)
        nrf_ble_scan_name_filter_t * p_name_filter = &p_scan_ctx->scan_filters.name_filter;
        memset(p_name_filter->target_name, 0, sizeof(p_name_filter->target_name));
        p_name_filter->name_cnt = 0;
#endif

#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        nrf_ble_scan_short_name_filter_t * p_short_name_filter =
                &p_scan_ctx->scan_filters.short_name_filter;
        memset(p_short_name_filter->short_name, 0, sizeof(p_short_name_filter->short_name));
        p_short_name_filter->name_cnt = 0;
#endif

#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        nrf_ble_scan_addr_filter_t * p_addr_filter = &p_scan_ctx->scan_filters.addr_filter;
        memset(p_addr_filter->target_addr, 0, sizeof(p_addr_filter->target_addr));
        p_addr_filter->addr_cnt = 0;
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        nrf_ble_scan_uuid_filter_t * p_uuid_filter = &p_scan_ctx->scan_filters.uuid_filter;
        memset(p_uuid_filter->uuid, 0, sizeof(p_uuid_filter->uuid));
        p_uuid_filter->uuid_cnt = 0;
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        nrf_ble_scan_appearance_filter_t * p_appearance_filter =
                &p_scan_ctx->scan_filters.appearance_filter;
        memset(p_appearance_filter->appearance, 0, sizeof(p_appearance_filter->appearance));
        p_appearance_filter->appearance_cnt = 0;
#endif

#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        nrf_ble_scan_manufacturer_filter_t * p_manufacturer_filter =
                &p_scan_ctx->scan_filters.manufacturer_filter;
        memset(p_manufacturer_filter->manufacturer_specific, 0, sizeof(p_manufacturer_filter->manufacturer_specific));
        p_manufacturer_filter->manufacturer_cnt = 0;
#endif


        return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_filters_enable(nrf_ble_scan_t * const p_scan_ctx,
                                       uint8_t mode,
                                       bool match_all)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

        // Check if the mode is correct.
        if ((!(mode & NRF_BLE_SCAN_ADDR_FILTER)) &&
            (!(mode & NRF_BLE_SCAN_NAME_FILTER)) &&
            (!(mode & NRF_BLE_SCAN_UUID_FILTER)) &&
            (!(mode & NRF_BLE_SCAN_SHORT_NAME_FILTER)) &&
            (!(mode & NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_FILTER)) &&
            (!(mode & NRF_BLE_SCAN_APPEARANCE_FILTER)))
        {
                return NRF_ERROR_INVALID_PARAM;
        }

        ret_code_t err_code;

        // Disable filters.
        err_code = nrf_ble_scan_filters_disable(p_scan_ctx);
        ASSERT(err_code == NRF_SUCCESS);

        nrf_ble_scan_filters_t * p_filters = &p_scan_ctx->scan_filters;

        // Turn on the filters of your choice.
#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        if (mode & NRF_BLE_SCAN_ADDR_FILTER)
        {
                p_filters->addr_filter.addr_filter_enabled = true;
        }
#endif

#if (NRF_BLE_SCAN_NAME_CNT > 0)
        if (mode & NRF_BLE_SCAN_NAME_FILTER)
        {
                p_filters->name_filter.name_filter_enabled = true;
        }
#endif

#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        if (mode & NRF_BLE_SCAN_SHORT_NAME_FILTER)
        {
                p_filters->short_name_filter.short_name_filter_enabled = true;
        }
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        if (mode & NRF_BLE_SCAN_UUID_FILTER)
        {
                p_filters->uuid_filter.uuid_filter_enabled = true;
        }
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        if (mode & NRF_BLE_SCAN_APPEARANCE_FILTER)
        {
                p_filters->appearance_filter.appearance_filter_enabled = true;
        }
#endif

#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        if (mode & NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_FILTER)
        {
                p_filters->manufacturer_filter.manufacturer_filter_enabled = true;
        }
#endif

        // Select the filter mode.
        p_filters->all_filters_mode = match_all;

        return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_filters_disable(nrf_ble_scan_t * const p_scan_ctx)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

