jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
        // Disable all filters.
#if (NRF_BLE_SCAN_NAME_CNT > 0)
        bool * p_name_filter_enabled = &p_scan_ctx->scan_filters.name_filter.name_filter_enabled;
        *p_name_filter_enabled = false;
#endif

#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        bool * p_addr_filter_enabled = &p_scan_ctx->scan_filters.addr_filter.addr_filter_enabled;
        *p_addr_filter_enabled = false;
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        bool * p_uuid_filter_enabled = &p_scan_ctx->scan_filters.uuid_filter.uuid_filter_enabled;
        *p_uuid_filter_enabled = false;
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        bool * p_appearance_filter_enabled =
                &p_scan_ctx->scan_filters.appearance_filter.appearance_filter_enabled;
        *p_appearance_filter_enabled = false;
#endif

#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        bool * p_manufacturer_filter_enabled =
                &p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_filter_enabled;
        *p_manufacturer_filter_enabled = false;
#endif

        return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_filter_get(nrf_ble_scan_t * const p_scan_ctx,
                                   nrf_ble_scan_filters_t * p_status)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);
        VERIFY_PARAM_NOT_NULL(p_status);

        *p_status = p_scan_ctx->scan_filters;

        return NRF_SUCCESS;
}


#endif // NRF_BLE_SCAN_FILTER_ENABLE


static void nrf_ble_scan_show_rssi_address(ble_gap_evt_adv_report_t const * const p_adv_report)
{

        ble_gap_addr_t * adv_address = &p_adv_report->peer_addr;
        NRF_LOG_INFO("Target peripheral: 0x%02x%02x%02x%02x%02x%02x",
                     adv_address->addr[5],
                     adv_address->addr[4],
                     adv_address->addr[3],
                     adv_address->addr[2],
                     adv_address->addr[1],
                     adv_address->addr[0]
                     );
        NRF_LOG_INFO("RSSI = %d dBm", p_adv_report->rssi);
}

static ble_gap_addr_t advertising_address;

/**@brief Function for calling the BLE_GAP_EVT_ADV_REPORT event to check whether the received
 *        scanning data matches the scan configuration.
 *
 * @param[in] p_scan_ctx    Pointer to the Scanning Module instance.
 * @param[in] p_adv_report  Advertising report.
 */
static void nrf_ble_scan_on_adv_report(nrf_ble_scan_t const * const p_scan_ctx,
                                       ble_gap_evt_adv_report_t const * const p_adv_report)
{
        scan_evt_t scan_evt;

#if (NRF_BLE_SCAN_FILTER_ENABLE == 1)
        uint8_t filter_cnt       = 0;
        uint8_t filter_match_cnt = 0;
#endif

        scan_evt.p_scan_params = &p_scan_ctx->scan_params;

        if (p_adv_report->rssi > -70)
        {
                if (memcmp(&advertising_address, &p_adv_report->peer_addr, sizeof(ble_gap_addr_t)) != 0)
                {
                        memcpy(&advertising_address, &p_adv_report->peer_addr, sizeof(ble_gap_addr_t));
                        nrf_ble_scan_show_rssi_address(p_adv_report);
                }
        }

        #if (NRF_BLE_SCAN_FILTER_ENABLE == 1)
        bool const all_filter_mode   = p_scan_ctx->scan_filters.all_filters_mode;
        bool is_filter_matched = false;

#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        bool const addr_filter_enabled = p_scan_ctx->scan_filters.addr_filter.addr_filter_enabled;
#endif

#if (NRF_BLE_SCAN_NAME_CNT > 0)
        bool const name_filter_enabled = p_scan_ctx->scan_filters.name_filter.name_filter_enabled;
#endif

#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        bool const short_name_filter_enabled =
                p_scan_ctx->scan_filters.short_name_filter.short_name_filter_enabled;
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        bool const uuid_filter_enabled = p_scan_ctx->scan_filters.uuid_filter.uuid_filter_enabled;
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        bool const appearance_filter_enabled =
                p_scan_ctx->scan_filters.appearance_filter.appearance_filter_enabled;
#endif


#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        bool const manufacturer_filter_enabled =
                p_scan_ctx->scan_filters.manufacturer_filter.manufacturer_filter_enabled;
#endif

        // If the whitelist is used, do not check the filters and return.
        if (is_whitelist_used(p_scan_ctx))
        {
                scan_evt.scan_evt_id        = NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT;
                scan_evt.params.p_not_found = p_adv_report;
                p_scan_ctx->evt_handler(&scan_evt);

#if (NRF_BLE_WHITELIST_SCANNING_FILTER == 1)
                bool is_filter_matched = false;

                #if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
                // Check the address filter.
                if (addr_filter_enabled)
                {
                        // Number of active filters.
                        filter_cnt++;
                        if (adv_addr_compare(p_adv_report, p_scan_ctx))
                        {
                                // Number of filters matched.
                                filter_match_cnt++;
                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.address_filter_match = true;
                                is_filter_matched = true;
                        }
                }
                #endif

                #if (NRF_BLE_SCAN_NAME_CNT > 0)
                // Check the name filter.
                if (name_filter_enabled)
                {
                        filter_cnt++;
                        if (adv_name_compare(p_adv_report, p_scan_ctx))
                        {
                                filter_match_cnt++;

                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.name_filter_match = true;
                                is_filter_matched = true;
                        }
                }
                #endif

                #if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
                if (short_name_filter_enabled)
                {
                        filter_cnt++;
                        if (adv_short_name_compare(p_adv_report, p_scan_ctx))
                        {
                                filter_match_cnt++;

                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.short_name_filter_match = true;
                                is_filter_matched = true;
                        }
                }
                #endif

                #if (NRF_BLE_SCAN_UUID_CNT > 0)
                // Check the UUID filter.
                if (uuid_filter_enabled)
                {
                        filter_cnt++;
                        if (adv_uuid_compare(p_adv_report, p_scan_ctx))
                        {
                                filter_match_cnt++;
                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.uuid_filter_match = true;
                                is_filter_matched = true;
                        }
                }
                #endif

                #if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
                // Check the appearance filter.
                if (appearance_filter_enabled)
                {
                        filter_cnt++;
                        if (adv_appearance_compare(p_adv_report, p_scan_ctx))
                        {
                                filter_match_cnt++;
                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.appearance_filter_match = true;
                                is_filter_matched = true;
                        }
                }
                scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_NOT_FOUND;
                #endif

                #if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
                // Check the appearance filter.
                if (manufacturer_filter_enabled)
                {
                        filter_cnt++;
                        if (adv_manufacturer_specific_compare(p_adv_report, p_scan_ctx))
                        {
                                NRF_LOG_INFO("Match Manufacturer Specific Data");
                                filter_match_cnt++;
                                // Information about the filters matched.
                                scan_evt.params.filter_match.filter_match.manufacturer_specific_filter_match = true;
                                is_filter_matched = true;

