jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
                        }
                }
                //scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_NOT_FOUND;
                #endif

//                #if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
//                // Check the manufacturer filter.
//                if (manufacturer_filter_enabled)
//                {
//                        filter_cnt++;
//
//                        NRF_LOG_HEXDUMP_INFO(p_adv_report->data.p_data, p_adv_report->data.len);
//                        if (adv_manufacturer_specific_compare(p_adv_report, p_scan_ctx))
//                        {
//                                NRF_LOG_INFO("Match Manufacturer Specific Data");
//                                filter_match_cnt++;
//                                // Information about the filters matched.
//                                scan_evt.params.filter_match.filter_match.manufacturer_specific_filter_match = true;
//                                is_filter_matched = true;
//                        }
//                }
//                #endif

                UNUSED_RETURN_VALUE(sd_ble_gap_scan_start(NULL, &p_scan_ctx->scan_buffer));
                if (is_filter_matched)
                {
                        nrf_ble_scan_connect_with_target(p_scan_ctx, p_adv_report);
                }
#else

                UNUSED_RETURN_VALUE(sd_ble_gap_scan_start(NULL, &p_scan_ctx->scan_buffer));
                nrf_ble_scan_connect_with_target(p_scan_ctx, p_adv_report);
#endif
                return;
        }




#if (NRF_BLE_SCAN_ADDRESS_CNT > 0)
        // Check the address filter.
        if (addr_filter_enabled)
        {
                // Number of active filters.
                filter_cnt++;
                if (adv_addr_compare(p_adv_report, p_scan_ctx))
                {
                        // Number of filters matched.
                        filter_match_cnt++;
                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.address_filter_match = true;
                        is_filter_matched = true;
                }
        }
#endif

#if (NRF_BLE_SCAN_NAME_CNT > 0)
        // Check the name filter.
        if (name_filter_enabled)
        {
                filter_cnt++;
                if (adv_name_compare(p_adv_report, p_scan_ctx))
                {
                        filter_match_cnt++;

                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.name_filter_match = true;
                        is_filter_matched = true;
                }
        }
#endif

#if (NRF_BLE_SCAN_SHORT_NAME_CNT > 0)
        if (short_name_filter_enabled)
        {
                filter_cnt++;
                if (adv_short_name_compare(p_adv_report, p_scan_ctx))
                {
                        filter_match_cnt++;

                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.short_name_filter_match = true;
                        is_filter_matched = true;
                }
        }
#endif

#if (NRF_BLE_SCAN_UUID_CNT > 0)
        // Check the UUID filter.
        if (uuid_filter_enabled)
        {
                filter_cnt++;
                if (adv_uuid_compare(p_adv_report, p_scan_ctx))
                {
                        filter_match_cnt++;
                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.uuid_filter_match = true;
                        is_filter_matched = true;
                }
        }
#endif

#if (NRF_BLE_SCAN_APPEARANCE_CNT > 0)
        // Check the appearance filter.
        if (appearance_filter_enabled)
        {
                filter_cnt++;
                if (adv_appearance_compare(p_adv_report, p_scan_ctx))
                {
                        filter_match_cnt++;
                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.appearance_filter_match = true;
                        is_filter_matched = true;
                }
        }
        scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_NOT_FOUND;
#endif

#if (NRF_BLE_SCAN_MANUFACTURER_SPECIFIC_CNT > 0)
        // Check the appearance filter.
        if (manufacturer_filter_enabled)
        {
                filter_cnt++;
                if (adv_manufacturer_specific_compare(p_adv_report, p_scan_ctx))
                {
                        //NRF_LOG_INFO("Match Manufacturer Specific Data");
                        filter_match_cnt++;
                        // Information about the filters matched.
                        scan_evt.params.filter_match.filter_match.manufacturer_specific_filter_match = true;
                        is_filter_matched = true;

//                        if (p_adv_report->rssi > -80)
//                        {
//                            if (memcmp(&advertising_address, &p_adv_report->peer_addr, sizeof(ble_gap_addr_t)) != 0)
//                            {
//                                memcpy(&advertising_address, &p_adv_report->peer_addr, sizeof(ble_gap_addr_t));
//                                nrf_ble_scan_show_rssi_address(p_adv_report);
//                            }
//                        }
                }
        }
        //scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_NOT_FOUND;
#endif

        scan_evt.params.filter_match.p_adv_report = p_adv_report;


        // In the multifilter mode, the number of the active filters must equal the number of the filters matched to generate the notification.
        if (all_filter_mode && (filter_match_cnt == filter_cnt))
        {
                scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_FILTER_MATCH;
                nrf_ble_scan_connect_with_target(p_scan_ctx, p_adv_report);
        }
        // In the normal filter mode, only one filter match is needed to generate the notification to the main application.
        else if ((!all_filter_mode) && is_filter_matched)
        {
                memset(&scan_evt, 0, sizeof(scan_evt));


