jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
                scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_FILTER_MATCH;



                nrf_ble_scan_connect_with_target(p_scan_ctx, p_adv_report);

        }
        else
        {
                scan_evt.scan_evt_id        = NRF_BLE_SCAN_EVT_NOT_FOUND;
                scan_evt.params.p_not_found = p_adv_report;

        }

        // If the event handler is not NULL, notify the main application.
        if (p_scan_ctx->evt_handler != NULL)
        {
                p_scan_ctx->evt_handler(&scan_evt);
        }

#endif // NRF_BLE_SCAN_FILTER_ENABLE

        // Resume the scanning.
        UNUSED_RETURN_VALUE(sd_ble_gap_scan_start(NULL, &p_scan_ctx->scan_buffer));
}


/**@brief Function for checking whether the whitelist is used.
 *
 * @param[in] p_scan_ctx   Scanning Module instance.
 */
bool is_whitelist_used(nrf_ble_scan_t const * const p_scan_ctx)
{
        if (p_scan_ctx->scan_params.filter_policy == BLE_GAP_SCAN_FP_WHITELIST ||
            p_scan_ctx->scan_params.filter_policy == BLE_GAP_SCAN_FP_WHITELIST_NOT_RESOLVED_DIRECTED)
        {
                return true;
        }

        return false;
}


/**@brief Function for restoring the default scanning parameters.
 *
 * @param[out] p_scan_ctx    Pointer to the Scanning Module instance.
 */
static void nrf_ble_scan_default_param_set(nrf_ble_scan_t * const p_scan_ctx)
{
        // Set the default parameters.
        p_scan_ctx->scan_params.active        = 1;
        p_scan_ctx->scan_params.interval      = NRF_BLE_SCAN_SCAN_INTERVAL;
        p_scan_ctx->scan_params.window        = NRF_BLE_SCAN_SCAN_WINDOW;
        p_scan_ctx->scan_params.timeout       = NRF_BLE_SCAN_SCAN_DURATION;
        p_scan_ctx->scan_params.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
        p_scan_ctx->scan_params.scan_phys     = BLE_GAP_PHY_1MBPS;
}


/**@brief Function for setting the default connection parameters.
 *
 * @param[out] p_scan_ctx    Pointer to the Scanning Module instance.
 */
static void nrf_ble_scan_default_conn_param_set(nrf_ble_scan_t * const p_scan_ctx)
{
        p_scan_ctx->conn_params.conn_sup_timeout =
                (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_SUPERVISION_TIMEOUT, UNIT_10_MS);
        p_scan_ctx->conn_params.min_conn_interval =
                (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_MIN_CONNECTION_INTERVAL, UNIT_1_25_MS);
        p_scan_ctx->conn_params.max_conn_interval =
                (uint16_t)MSEC_TO_UNITS(NRF_BLE_SCAN_MAX_CONNECTION_INTERVAL, UNIT_1_25_MS);
        p_scan_ctx->conn_params.slave_latency =
                (uint16_t)NRF_BLE_SCAN_SLAVE_LATENCY;
}


/**@brief Function for calling the BLE_GAP_EVT_TIMEOUT event.
 *
 * @param[in] p_scan_ctx  Pointer to the Scanning Module instance.
 * @param[in] p_gap       GAP event structure.
 */
static void nrf_ble_scan_on_timeout(nrf_ble_scan_t const * const p_scan_ctx,
                                    ble_gap_evt_t const * const p_gap)
{
        ble_gap_evt_timeout_t const * p_timeout = &p_gap->params.timeout;
        scan_evt_t scan_evt;

        memset(&scan_evt, 0, sizeof(scan_evt));

        if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
        {
                NRF_LOG_DEBUG("BLE_GAP_SCAN_TIMEOUT");
                if (p_scan_ctx->evt_handler != NULL)
                {
                        scan_evt.scan_evt_id        = NRF_BLE_SCAN_EVT_SCAN_TIMEOUT;
                        scan_evt.p_scan_params      = &p_scan_ctx->scan_params;
                        scan_evt.params.timeout.src = p_timeout->src;

                        p_scan_ctx->evt_handler(&scan_evt);
                }
        }
}


/**@brief Function for calling the BLE_GAP_EVT_SCAN_REQ_REPORT event.
 *
 * @param[in] p_scan_ctx  Pointer to the Scanning Module instance.
 * @param[in] p_gap       GAP event structure.
 */
static void nrf_ble_scan_on_req_report(nrf_ble_scan_t const * const p_scan_ctx,
                                       ble_gap_evt_t const * const p_gap)
{
        ble_gap_evt_scan_req_report_t const * p_req_report = &p_gap->params.scan_req_report;
        scan_evt_t scan_evt;

        memset(&scan_evt, 0, sizeof(scan_evt));

        if (p_scan_ctx->evt_handler != NULL)
        {
                scan_evt.scan_evt_id       = NRF_BLE_SCAN_EVT_SCAN_REQ_REPORT;
                scan_evt.p_scan_params     = &p_scan_ctx->scan_params;
                scan_evt.params.req_report = *p_req_report;

                p_scan_ctx->evt_handler(&scan_evt);
        }
}


/**@brief Function for stopping the scanning.
 */
void nrf_ble_scan_stop(void)
{
        // It is ok to ignore the function return value here, because this function can return NRF_SUCCESS or
        // NRF_ERROR_INVALID_STATE, when app is not in the scanning state.
        UNUSED_RETURN_VALUE(sd_ble_gap_scan_stop());
}


ret_code_t nrf_ble_scan_init(nrf_ble_scan_t            * const p_scan_ctx,
                             nrf_ble_scan_init_t const * const p_init,
                             nrf_ble_scan_evt_handler_t evt_handler)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

        p_scan_ctx->evt_handler = evt_handler;

#if (NRF_BLE_SCAN_FILTER_ENABLE == 1)
        // Disable all scanning filters.
        memset(&p_scan_ctx->scan_filters, 0, sizeof(p_scan_ctx->scan_filters));
#endif

        // If the pointer to the initialization structure exist, use it to scan the configuration.
        if (p_init != NULL)
        {
                p_scan_ctx->connect_if_match = p_init->connect_if_match;
                p_scan_ctx->conn_cfg_tag     = p_init->conn_cfg_tag;

                if (p_init->p_scan_param != NULL)
                {
                        p_scan_ctx->scan_params = *p_init->p_scan_param;
                }
                else
                {
                        // Use the default static configuration.
                        nrf_ble_scan_default_param_set(p_scan_ctx);
                }

                if (p_init->p_conn_param != NULL)
                {
                        p_scan_ctx->conn_params = *p_init->p_conn_param;
                }
                else
                {
                        // Use the default static configuration.
                        nrf_ble_scan_default_conn_param_set(p_scan_ctx);
                }
        }
        // If pointer is NULL, use the static default configuration.
        else
        {
                nrf_ble_scan_default_param_set(p_scan_ctx);
                nrf_ble_scan_default_conn_param_set(p_scan_ctx);

                p_scan_ctx->connect_if_match = false;
        }

        // Assign a buffer where the advertising reports are to be stored by the SoftDevice.
        p_scan_ctx->scan_buffer.p_data = p_scan_ctx->scan_buffer_data;
        p_scan_ctx->scan_buffer.len    = NRF_BLE_SCAN_BUFFER;

        return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_start(nrf_ble_scan_t const * const p_scan_ctx)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

        ret_code_t err_code;
        scan_evt_t scan_evt;

        memset(&scan_evt, 0, sizeof(scan_evt));

        nrf_ble_scan_stop();

        // If the whitelist is used and the event handler is not NULL, send the whitelist request to the main application.
        if (is_whitelist_used(p_scan_ctx))
        {
                if (p_scan_ctx->evt_handler != NULL)
                {
                        scan_evt.scan_evt_id = NRF_BLE_SCAN_EVT_WHITELIST_REQUEST;
                        p_scan_ctx->evt_handler(&scan_evt);
                }
        }

        // Start the scanning.
        err_code = sd_ble_gap_scan_start(&p_scan_ctx->scan_params, &p_scan_ctx->scan_buffer);

        // It is okay to ignore this error, because the scan stopped earlier.
        if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_SUCCESS))
        {
                NRF_LOG_ERROR("sd_ble_gap_scan_start returned 0x%x", err_code);
                return (err_code);
        }
        NRF_LOG_DEBUG("Scanning");

        return NRF_SUCCESS;
}


ret_code_t nrf_ble_scan_params_set(nrf_ble_scan_t              * const p_scan_ctx,
                                   ble_gap_scan_params_t const * const p_scan_param)
{
        VERIFY_PARAM_NOT_NULL(p_scan_ctx);

        nrf_ble_scan_stop();

