jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/components/ble/nrf_ble_scan/nrf_ble_scan.c
        if (p_scan_param != NULL)
        {
                // Assign new scanning parameters.
                p_scan_ctx->scan_params = *p_scan_param;
        }
        else
        {
                // If NULL, use the default static configuration.
                nrf_ble_scan_default_param_set(p_scan_ctx);
        }

        NRF_LOG_DEBUG("Scanning parameters have been changed successfully");

        return NRF_SUCCESS;
}


/**@brief Function for calling the BLE_GAP_EVT_CONNECTED event.
 *
 * @param[in] p_scan_ctx  Pointer to the Scanning Module instance.
 * @param[in] p_gap_evt   GAP event structure.
 */
static void nrf_ble_scan_on_connected_evt(nrf_ble_scan_t const * const p_scan_ctx,
                                          ble_gap_evt_t const * const p_gap_evt)
{
        scan_evt_t scan_evt;

        memset(&scan_evt, 0, sizeof(scan_evt));
        scan_evt.scan_evt_id                  = NRF_BLE_SCAN_EVT_CONNECTED;
        scan_evt.params.connected.p_connected = &p_gap_evt->params.connected;
        scan_evt.params.connected.conn_handle = p_gap_evt->conn_handle;
        scan_evt.p_scan_params                = &p_scan_ctx->scan_params;

        if (p_scan_ctx->evt_handler != NULL)
        {
                p_scan_ctx->evt_handler(&scan_evt);
        }
}


ret_code_t nrf_ble_scan_copy_addr_to_sd_gap_addr(ble_gap_addr_t * p_gap_addr,
                                                 const uint8_t addr[BLE_GAP_ADDR_LEN])
{
        uint16_t addr_type;

        addr_type = nrf_ble_scan_address_type_decode(addr);

        if (addr_type == BLE_ERROR_GAP_INVALID_BLE_ADDR)
        {
                return BLE_ERROR_GAP_INVALID_BLE_ADDR;
        }

        p_gap_addr->addr_type = addr_type;

        for (uint8_t i = 0; i < BLE_GAP_ADDR_LEN; ++i)
        {
                p_gap_addr->addr[i] = addr[BLE_GAP_ADDR_LEN - (i + 1)];
        }

        return NRF_SUCCESS;
}


void nrf_ble_scan_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_contex)
{
        nrf_ble_scan_t                 * p_scan_data  = (nrf_ble_scan_t *)p_contex;
        ble_gap_evt_adv_report_t const * p_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
        ble_gap_evt_t const            * p_gap_evt    = &p_ble_evt->evt.gap_evt;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_ADV_REPORT:
                nrf_ble_scan_on_adv_report(p_scan_data, p_adv_report);
                break;

        case BLE_GAP_EVT_TIMEOUT:
                nrf_ble_scan_on_timeout(p_scan_data, p_gap_evt);
                break;

        case BLE_GAP_EVT_SCAN_REQ_REPORT:
                nrf_ble_scan_on_req_report(p_scan_data, p_gap_evt);

                break;

        case BLE_GAP_EVT_CONNECTED:
                nrf_ble_scan_on_connected_evt(p_scan_data, p_gap_evt);
                break;

        default:
                break;
        }
}


#endif // NRF_BLE_SCAN_ENABLED
